x=1:10;
y=1:10;
z=[9.92 9.90 9.87 9.85 9.90 9.92 9.85 9.80 9.83 9.86;
   9.09 9.08 9.10 9.10 9.07 9.02 9.04 9.04 9.10 9.01;
   8.23 8.23 8.21 8.27 8.23 8.01 8.23 8.19 8.16 8.21;
   7.37 7.38 7.38 7.39 7.48 7.36 7.39 7.35 7.38 7.36;
   6.48 6.52 6.52 6.49 6.51 6.60 6.52 6.47 6.47 6.38;
   5.64 5.60 5.66 5.62 5.60 5.58 5.59 5.55 5.63 5.60;
   4.68 4.70 4.69 4.64 4.69 4.70 4.66 4.69 4.68 4.65;
   3.78 3.85 3.86 3.84 3.83 3.81 3.81 3.82 3.76 3.74;
   2.91 2.93 2.92 2.99 2.95 2.92 2.88 2.89 2.88 2.86;
   1.93 2.07 2.09 2.10 2.00 1.97 2.01 2.03 2.00 1.88;
   ];
mesh(x,y,z)
figure(1)
xlabel('x/cm')
ylabel('y/cm')
zlabel('z/V')
title('Data Plot')
grid on
zz=zeros(1,10);
for i=1:10
    zz(i)=mean(z(i,:));
end
a=polyfit(x,zz,1);
xi=0:0.001:10;
zzi=polyval(a,xi);

figure(2)
plot(x,zz,'go','MarkerEdgeColor','n','MarkerFaceColor','g','MarkerSize',6)
xlabel('x/cm')
ylabel('z/V')
title('Linear fit')
hold on
plot(xi,zzi,'linewidth',2,'markersize',16)
legend('原始数据点','拟合直线')